@include('parts.header')
<div class="main-registration">
    <div class="main-registration-title">
        Регистрация
    </div>
    <div class="registration-block">
        <div class="registration-block-title-1">
            Создайте учетную запись с помощью аккаунта
        </div>
        <div class="registration-block-soc">
            <div class="registration-block-soc-item">
                <a href="#">
                    <svg width="49" height="49" viewBox="0 0 49 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0.63623 24.9431C0.63623 11.6883 11.3814 0.943115 24.6362 0.943115C37.8911 0.943115 48.6362 11.6883 48.6362 24.9431C48.6362 38.1979 37.8911 48.9431 24.6362 48.9431C11.3814 48.9431 0.63623 38.1979 0.63623 24.9431Z" fill="#F68634"/>
                        <path d="M27.2322 30.3834L30.8189 33.8459C31.5537 34.5537 31.5537 35.7032 30.8189 36.4117C30.0849 37.1202 28.8952 37.1202 28.162 36.4117L24.6356 33.0092L21.1123 36.4117C20.7449 36.7656 20.2635 36.9427 19.7821 36.9427C19.3015 36.9427 18.8209 36.7656 18.4535 36.4117C17.7195 35.7032 17.7195 34.5545 18.4527 33.8459L22.0398 30.3834C20.7338 30.0962 19.4742 29.5967 18.3141 28.8941C17.4362 28.3598 17.1725 27.2403 17.7256 26.3921C18.2773 25.5428 19.4374 25.2871 20.3169 25.8214C22.9434 27.4163 26.327 27.4167 28.9551 25.8214C29.8346 25.2871 30.9943 25.5428 31.5471 26.3921C32.1003 27.2396 31.8358 28.3598 30.9579 28.8941C29.7978 29.5974 28.5382 30.0962 27.2322 30.3834Z" fill="white"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M18.2041 19.1367C18.2041 22.5511 21.0817 25.3284 24.62 25.3284C28.1591 25.3284 31.0359 22.5511 31.0359 19.1367C31.0359 15.7212 28.1591 12.9431 24.62 12.9431C21.0817 12.9431 18.2041 15.7212 18.2041 19.1367ZM27.2765 19.1367C27.2765 17.7226 26.0849 16.5728 24.62 16.5728C23.1563 16.5728 21.9635 17.7226 21.9635 19.1367C21.9635 20.5497 23.1563 21.7002 24.62 21.7002C26.0849 21.7002 27.2765 20.5497 27.2765 19.1367Z" fill="white"/>
                    </svg>
                </a>
            </div>
            <div class="registration-block-soc-item">
                <a href="#">
                    <svg width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M24.0001 9.28C28.5067 9.28 31.5467 11.2267 33.2801 12.8533L40.0534 6.24C35.8934 2.37333 30.4801 0 24.0001 0C14.6134 0 6.50673 5.38667 2.56006 13.2267L10.3201 19.2533C12.2667 13.4667 17.6534 9.28 24.0001 9.28Z" fill="#EA4335"/>
                        <path d="M47.04 24.5333C47.04 22.56 46.88 21.12 46.5333 19.6266H24V28.5333H37.2267C36.96 30.7466 35.52 34.08 32.32 36.32L39.8933 42.1866C44.4267 38 47.04 31.84 47.04 24.5333Z" fill="#4285F4"/>
                        <path d="M10.3467 28.7467C9.84 27.2533 9.54667 25.6533 9.54667 24C9.54667 22.3467 9.84 20.7467 10.32 19.2533L2.56 13.2267C0.933333 16.48 0 20.1333 0 24C0 27.8667 0.933333 31.52 2.56 34.7733L10.3467 28.7467Z" fill="#FBBC05"/>
                        <path d="M24 47.9999C30.48 47.9999 35.92 45.8666 39.8933 42.1866L32.32 36.3199C30.2933 37.7333 27.5733 38.7199 24 38.7199C17.6533 38.7199 12.2667 34.5333 10.3467 28.7466L2.58667 34.7733C6.53334 42.6133 14.6133 47.9999 24 47.9999Z" fill="#34A853"/>
                    </svg>
                </a>
            </div>
            <div class="registration-block-soc-item">
                <a href="#">
                    <svg width="49" height="49" viewBox="0 0 49 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M17.3823 0.925568H32.1177C45.5658 0.925568 48.75 4.10976 48.75 17.5579V32.2933C48.75 45.7414 45.5658 48.9256 32.1177 48.9256H17.3823C3.93419 48.9256 0.75 45.7414 0.75 32.2933V17.5579C0.75 4.10976 3.93419 0.925568 17.3823 0.925568Z" fill="#4680C2"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M39.9822 16.2467C40.2193 15.5015 39.9822 14.9595 38.9321 14.9595H35.443C34.5623 14.9595 34.1558 15.4337 33.9187 15.9419C33.9187 15.9419 32.1233 20.2778 29.6166 23.0893C28.8036 23.9023 28.431 24.1733 27.9907 24.1733C27.7535 24.1733 27.4487 23.9023 27.4487 23.1571V16.2128C27.4487 15.3321 27.1777 14.9256 26.4324 14.9256H20.9448C20.4028 14.9256 20.0641 15.3321 20.0641 15.7386C20.0641 16.5855 21.3174 16.7887 21.4529 19.1599V24.3088C21.4529 25.4267 21.2497 25.6299 20.8093 25.6299C19.6237 25.6299 16.7444 21.2601 15.0168 16.2806C14.678 15.2982 14.3393 14.9256 13.4586 14.9256H9.93559C8.91938 14.9256 8.75 15.3999 8.75 15.908C8.75 16.8226 9.93559 21.4295 14.2715 27.5269C17.1509 31.6934 21.2497 33.9291 24.942 33.9291C27.1777 33.9291 27.4487 33.421 27.4487 32.5742V29.4239C27.4487 28.4076 27.6519 28.2383 28.3633 28.2383C28.8714 28.2383 29.786 28.5092 31.8523 30.5078C34.2235 32.879 34.63 33.963 35.9511 33.963H39.4402C40.4564 33.963 40.9307 33.4549 40.6597 32.4725C40.3548 31.4902 39.2031 30.0675 37.7126 28.3737C36.8996 27.4253 35.6801 26.3752 35.3075 25.867C34.7994 25.1896 34.9349 24.9186 35.3075 24.3088C35.2737 24.3088 39.5418 18.2792 39.9822 16.2467Z" fill="white"/>
                    </svg>
                </a>
             </div>
        </div>
        <div class="registration-block-line">
            <svg width="244" height="3" viewBox="0 0 244 3" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect y="0.836426" width="243.5" height="2" fill="#666666" fill-opacity="0.25"/>
            </svg>
            <div class="registration-alert-line-text">
                или
            </div>
            <svg width="244" height="3" viewBox="0 0 244 3" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect y="0.836426" width="243.5" height="2" fill="#666666" fill-opacity="0.25"/>
            </svg>
        </div>
        <div class="registration-block-title-2">
           Зарегистрируйтесь с помощью вашего электронного адреса
        </div>
        <div class="registration-block-form" >
            <form method="POST" class="registration-block-form-inner" action="{{route('auth_register')}}">
                @csrf
                <div class="registration-block-form-inner-label-email">
                    E-mail
                </div>
                <input required type="email"  name="email" class="auth-block-form-input_email" placeholder="Введите ваш e-mail">
                <div class="registration-block-form-inner-label-password">
                    <div class="registration-block-form-inner-label-password-text">
                        Password
                    </div>
                    <div class="registration-block-form-inner-label-password-hide">
                        <svg width="25" height="25" viewBox="0 0 25 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M20.0194 5.2177L19.2835 4.48176C19.0755 4.27377 18.6915 4.30578 18.4515 4.59372L15.8913 7.13769C14.7392 6.64174 13.4754 6.40174 12.1473 6.40174C8.19519 6.41768 4.77141 8.72165 3.12329 12.0339C3.02726 12.2419 3.02726 12.4978 3.12329 12.6738C3.89122 14.2418 5.04329 15.5378 6.4833 16.5138L4.3873 18.6417C4.1473 18.8817 4.11529 19.2657 4.27534 19.4737L5.01128 20.2097C5.21928 20.4177 5.60326 20.3856 5.84326 20.0977L19.8912 6.04982C20.1952 5.80995 20.2272 5.42599 20.0192 5.21798L20.0194 5.2177ZM12.9953 10.0496C12.7233 9.98557 12.4353 9.90561 12.1633 9.90561C10.8033 9.90561 9.71538 10.9936 9.71538 12.3535C9.71538 12.6256 9.7794 12.9135 9.85935 13.1855L8.78724 14.2416C8.46728 13.6816 8.2913 13.0575 8.2913 12.3536C8.2913 10.2256 10.0033 8.51358 12.1313 8.51358C12.8354 8.51358 13.4593 8.68956 14.0193 9.00952L12.9953 10.0496Z" fill="#666666" fill-opacity="0.8"/>
                            <path d="M21.1714 12.0338C20.6114 10.9137 19.8753 9.90582 18.9634 9.08978L15.9874 12.0338V12.3537C15.9874 14.4817 14.2754 16.1937 12.1474 16.1937H11.8274L9.93945 18.0817C10.6435 18.2257 11.3795 18.3217 12.0995 18.3217C16.0516 18.3217 19.4754 16.0178 21.1235 12.6896C21.2675 12.4655 21.2675 12.2416 21.1714 12.0336L21.1714 12.0338Z" fill="#666666" fill-opacity="0.8"/>
                        </svg>
                        <div class="registration-block-form-inner-label-password-hide-text">
                            View
                        </div>
                    </div>
                </div>
                <input required type="password" name="password" class="auth-block-form-input_password" placeholder="Введите ваш пароль">
                <div class="registration-block-form-inner-label-password-desc">
                    Используйте 8 или более символов с сочетанием букв, цифр и символов
                </div>
                <div class="registration-block-agreement">
                    Создавая учетную запись, вы соглашаетесь с
                    <a class="a-border-black" href="#">
                        Условиями использования.
                    </a>
                </div>
                <div id="captcha"></div>
                <button type="submit" class="registration-block-registration">
                    Зарегистрироваться
                </button>
            </form>
        </div>
        <div class="registration-block-reg">
            У вас уже есть аккаунт? &nbsp;
            <div class="a-border-black">
                <a href="{{route('login')}}">
                    Авторизоваться
                </a>
            </div>
        </div>
        @if (count($errors) > 0)
            <div class="alert alert-danger">
                <ul>
                    @foreach ($errors->all() as $error)
                        <li>{{ $error }}</li>
                    @endforeach
                </ul>
            </div>
        @endif
    </div>
</div>
@include('parts.footer')
